packages/core/src/external/carequality/ihe-gateway-v2/inbound/__tests__/xmls/epic-iti-39-request.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:urn="urn:ihe:iti:xds-b:2007">
  <soap:Header>
    <wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing" soap:mustUnderstand="1">https://sfd-np.et0121.epichosted.com:14430/interconnect-ce-env1/wcf/epic.community.hie/respondinggateway.svc/mtom-ceq</wsa:To>
    <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing" soap:mustUnderstand="1">urn:ihe:iti:2007:CrossGatewayRetrieve</wsa:Action>
    <wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">urn:uuid:8da209fa-495c-44f7-bdc8-7b36ceadf65e</wsa:MessageID>
    <wsa:ReplyTo xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xs="http://www.w3.org/2001/XMLSchema" ID="_6ca1b876-79aa-4e94-b51e-e7b1bdb3bfc9" IssueInstant="2023-12-06T22:53:08.377Z" Version="2.0">
        <saml2:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress">support@metriport.com</saml2:Issuer>
        <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
          <ds:SignedInfo>
            <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
            <ds:Reference URI="#_6ca1b876-79aa-4e94-b51e-e7b1bdb3bfc9">
              <ds:Transforms>
                <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                  <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xs"/>
                </ds:Transform>
              </ds:Transforms>
              <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
              <ds:DigestValue>hOboEWuPSJivYkugp5tqusnQzB0=</ds:DigestValue>
            </ds:Reference>
          </ds:SignedInfo>
          <ds:SignatureValue>D5pU2kdDqDwjWAE1LMchF/3Z3edv4OYpa2+62203dbrzhaPh5a9q8gRxXlO4H2jFJE8HF3TvAp5n0j4Y9ZG8gzmYjU5ZT4k/Qm65Pq63mGY5Gabn09Tz9hVO9CQ2GgBivCG+exXFsJFkPSu/gbA3/dLEpsdqsbqCe9wDeSm7Ye76hbLEFUGdO1umO6tIZepuk/efMGOR6OVlZPWuGBvthFw1SnSZiGrwiYf0ZqdfrCw5m49c8LiGrvBHPjkFpaP+Y+p2/qHAZIpHM013+9czRDnKEHV88J7vo9WzG5+BgTO1Nea6J9VGeLXx5Dp/zqlJUQ1dcwqjRM5C+a3jxsGyqw==</ds:SignatureValue>
          <ds:KeyInfo>
            <ds:KeyValue>
              <ds:RSAKeyValue>
                <ds:Modulus>4tOa7loCPgXnfXjKJ1k+wWnb9EdZ3LV3J1CfO7Kg4r/1UDEsyg0zNW/D7KpgZIi9b4YWc2YC7LzD
Nnk1d4sB767rdMk0cIv4ysfpXOVyGFXF4RzoZcGxBU3ZhbqJybjtunDrmvA8NHymD4B/bz28sIVR
tJDV0H/g4I7jDNyCl6IUeQJKUTBa90UDdJgxFnMD0PmuxjA40injjZ707GuA+StggA0kGCIfhQEV
n1g7iL3O8zo9Yp0y3QkWtBgrxOTnI/1UPj6Sq0qBlD1C0obh327OJOMU9qLRrJLs6MIUzy7PeZLx
glQbCKX5zRhtEDe1G/FqQw/5zcxicBsgXtelMQ==</ds:Modulus>
                <ds:Exponent>AQAB</ds:Exponent>
              </ds:RSAKeyValue>
            </ds:KeyValue>
            <ds:X509Data>
              <ds:X509Certificate>MIIFHDCCBASgAwIBAgIIUbdr3gSmeh8wDQYJKoZIhvcNAQELBQAwgasxCzAJBgNVBAYTAlVTMRMw
EQYDVQQIDApDYWxpZm9ybmlhMRIwEAYDVQQHDAlTYW4gRGllZ28xEzARBgNVBAoMCkVNUiBEaXJl
Y3QxNjA0BgNVBAsMLUNlcnRpZmljYXRpb24gQXV0aG9yaXR5IChjZXJ0cy5lbXJkaXJlY3QuY29t
KTEmMCQGA1UEAwwdRU1SIERpcmVjdCBUZXN0IERldmljZSBTdWJDQTIwHhcNMjMxMTAyMjEyNTQy
WhcNMjQxMTAyMjEyNTQyWjB6MQswCQYDVQQGEwJVUzETMBEGA1UECAwKQ2FsaWZvcm5pYTEXMBUG
A1UECgwOTWV0cmlwb3J0IEluYy4xGTAXBgNVBAsMEENBUkVRVUFMSVRZLVRFU1QxIjAgBgNVBAMM
GWloZS5zdGFnaW5nLm1ldHJpcG9ydC5jb20wggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
AQDi05ruWgI+Bed9eMonWT7Badv0R1nctXcnUJ87sqDiv/VQMSzKDTM1b8PsqmBkiL1vhhZzZgLs
vMM2eTV3iwHvrut0yTRwi/jKx+lc5XIYVcXhHOhlwbEFTdmFuonJuO26cOua8Dw0fKYPgH9vPbyw
hVG0kNXQf+DgjuMM3IKXohR5AkpRMFr3RQN0mDEWcwPQ+a7GMDjSKeONnvTsa4D5K2CADSQYIh+F
ARWfWDuIvc7zOj1inTLdCRa0GCvE5Ocj/VQ+PpKrSoGUPULShuHfbs4k4xT2otGskuzowhTPLs95
kvGCVBsIpfnNGG0QN7Ub8WpDD/nNzGJwGyBe16UxAgMBAAGjggFyMIIBbjBaBggrBgEFBQcBAQRO
MEwwSgYIKwYBBQUHMAKGPmh0dHA6Ly9jZXJ0cy5lbXJkaXJlY3QuY29tL2NlcnRzL0VNUkRpcmVj
dFRlc3REZXZpY2VTdWJDQTIuY3J0MB0GA1UdDgQWBBTHhH0qkOSuubx9pjHaChsgjBffJTAMBgNV
HRMBAf8EAjAAMB8GA1UdIwQYMBaAFLALWDvFk63Gb2VdEcASrVrch4Y1ME0GA1UdHwRGMEQwQqBA
oD6GPGh0dHA6Ly9jZXJ0cy5lbXJkaXJlY3QuY29tL2NybC9FTVJEaXJlY3RUZXN0RGV2aWNlU3Vi
Q0EyLmNybDAOBgNVHQ8BAf8EBAMCBaAwHQYDVR0lBBYwFAYIKwYBBQUHAwEGCCsGAQUFBwMCMEQG
A1UdEQQ9MDuCGWloZS5zdGFnaW5nLm1ldHJpcG9ydC5jb22GHkhUVFA6Ly9XV1cuQ0FSRVFVQUxJ
VFkuT1JHL1YwMTANBgkqhkiG9w0BAQsFAAOCAQEACASUTJh9KQhdiksve1sR8cT/bB5Rn12qvlo3
6kNf0FvK6qxUY+bei3F1xeZ2X+2ALi88EypPwXH9N0CFsUNLG7twnjVtuIEPq/u6NU4dX55XdCIR
QcTjj6ctSLGoN1aNo2jBD/FtPScuTR95c/Gza43RTqJaPKrVnaWd9QA6TVSBimIodpYDz02ciM2v
889iK8HqYeGgk3m6SmAyliRQNcM1CM0dnjm3Jwa2dhHYtNNd0UUSd3mHAuqOTy9g9KBFp6pUVcVY
aDY9m0g9hmEBJqAR4Ua3PYudVAn5ibiu45fxXvfg8ewh9vviw/FPfjqIwEiNA53B24GPnkC9J/n2
Sw==</ds:X509Certificate>
            </ds:X509Data>
          </ds:KeyInfo>
        </ds:Signature>
        <saml2:Subject>
          <saml2:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=ihe.staging.metriport.com,OU=CAREQUALITY-TEST,O=Metriport Inc.,ST=California,C=US</saml2:NameID>
          <saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key">
            <saml2:SubjectConfirmationData>
              <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                <ds:KeyValue>
                  <ds:RSAKeyValue>
                    <ds:Modulus>4tOa7loCPgXnfXjKJ1k+wWnb9EdZ3LV3J1CfO7Kg4r/1UDEsyg0zNW/D7KpgZIi9b4YWc2YC7LzD
Nnk1d4sB767rdMk0cIv4ysfpXOVyGFXF4RzoZcGxBU3ZhbqJybjtunDrmvA8NHymD4B/bz28sIVR
tJDV0H/g4I7jDNyCl6IUeQJKUTBa90UDdJgxFnMD0PmuxjA40injjZ707GuA+StggA0kGCIfhQEV
n1g7iL3O8zo9Yp0y3QkWtBgrxOTnI/1UPj6Sq0qBlD1C0obh327OJOMU9qLRrJLs6MIUzy7PeZLx
glQbCKX5zRhtEDe1G/FqQw/5zcxicBsgXtelMQ==</ds:Modulus>
                    <ds:Exponent>AQAB</ds:Exponent>
                  </ds:RSAKeyValue>
                </ds:KeyValue>
                <ds:X509Data>
                  <ds:X509Certificate>MIIFHDCCBASgAwIBAgIIUbdr3gSmeh8wDQYJKoZIhvcNAQELBQAwgasxCzAJBgNVBAYTAlVTMRMw
EQYDVQQIDApDYWxpZm9ybmlhMRIwEAYDVQQHDAlTYW4gRGllZ28xEzARBgNVBAoMCkVNUiBEaXJl
Y3QxNjA0BgNVBAsMLUNlcnRpZmljYXRpb24gQXV0aG9yaXR5IChjZXJ0cy5lbXJkaXJlY3QuY29t
KTEmMCQGA1UEAwwdRU1SIERpcmVjdCBUZXN0IERldmljZSBTdWJDQTIwHhcNMjMxMTAyMjEyNTQy
WhcNMjQxMTAyMjEyNTQyWjB6MQswCQYDVQQGEwJVUzETMBEGA1UECAwKQ2FsaWZvcm5pYTEXMBUG
A1UECgwOTWV0cmlwb3J0IEluYy4xGTAXBgNVBAsMEENBUkVRVUFMSVRZLVRFU1QxIjAgBgNVBAMM
GWloZS5zdGFnaW5nLm1ldHJpcG9ydC5jb20wggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
AQDi05ruWgI+Bed9eMonWT7Badv0R1nctXcnUJ87sqDiv/VQMSzKDTM1b8PsqmBkiL1vhhZzZgLs
vMM2eTV3iwHvrut0yTRwi/jKx+lc5XIYVcXhHOhlwbEFTdmFuonJuO26cOua8Dw0fKYPgH9vPbyw
hVG0kNXQf+DgjuMM3IKXohR5AkpRMFr3RQN0mDEWcwPQ+a7GMDjSKeONnvTsa4D5K2CADSQYIh+F
ARWfWDuIvc7zOj1inTLdCRa0GCvE5Ocj/VQ+PpKrSoGUPULShuHfbs4k4xT2otGskuzowhTPLs95
kvGCVBsIpfnNGG0QN7Ub8WpDD/nNzGJwGyBe16UxAgMBAAGjggFyMIIBbjBaBggrBgEFBQcBAQRO
MEwwSgYIKwYBBQUHMAKGPmh0dHA6Ly9jZXJ0cy5lbXJkaXJlY3QuY29tL2NlcnRzL0VNUkRpcmVj
dFRlc3REZXZpY2VTdWJDQTIuY3J0MB0GA1UdDgQWBBTHhH0qkOSuubx9pjHaChsgjBffJTAMBgNV
HRMBAf8EAjAAMB8GA1UdIwQYMBaAFLALWDvFk63Gb2VdEcASrVrch4Y1ME0GA1UdHwRGMEQwQqBA
oD6GPGh0dHA6Ly9jZXJ0cy5lbXJkaXJlY3QuY29tL2NybC9FTVJEaXJlY3RUZXN0RGV2aWNlU3Vi
Q0EyLmNybDAOBgNVHQ8BAf8EBAMCBaAwHQYDVR0lBBYwFAYIKwYBBQUHAwEGCCsGAQUFBwMCMEQG
A1UdEQQ9MDuCGWloZS5zdGFnaW5nLm1ldHJpcG9ydC5jb22GHkhUVFA6Ly9XV1cuQ0FSRVFVQUxJ
VFkuT1JHL1YwMTANBgkqhkiG9w0BAQsFAAOCAQEACASUTJh9KQhdiksve1sR8cT/bB5Rn12qvlo3
6kNf0FvK6qxUY+bei3F1xeZ2X+2ALi88EypPwXH9N0CFsUNLG7twnjVtuIEPq/u6NU4dX55XdCIR
QcTjj6ctSLGoN1aNo2jBD/FtPScuTR95c/Gza43RTqJaPKrVnaWd9QA6TVSBimIodpYDz02ciM2v
889iK8HqYeGgk3m6SmAyliRQNcM1CM0dnjm3Jwa2dhHYtNNd0UUSd3mHAuqOTy9g9KBFp6pUVcVY
aDY9m0g9hmEBJqAR4Ua3PYudVAn5ibiu45fxXvfg8ewh9vviw/FPfjqIwEiNA53B24GPnkC9J/n2
Sw==</ds:X509Certificate>
                </ds:X509Data>
              </ds:KeyInfo>
            </saml2:SubjectConfirmationData>
          </saml2:SubjectConfirmation>
        </saml2:Subject>
        <saml2:Conditions NotBefore="2023-12-06T22:53:08.377Z" NotOnOrAfter="2023-12-06T22:58:08.377Z">
          <saml2:AudienceRestriction>
            <saml2:Audience>https://sfd-np.et0121.epichosted.com:14430/interconnect-ce-env1/wcf/epic.community.hie/respondinggateway.svc/mtom-ceq</saml2:Audience>
          </saml2:AudienceRestriction>
        </saml2:Conditions>
        <saml2:AuthnStatement AuthnInstant="2023-12-06T22:53:08.377Z">
          <saml2:SubjectLocality Address="127.0.0.1" DNSName="localhost"/>
          <saml2:AuthnContext>
            <saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509</saml2:AuthnContextClassRef>
          </saml2:AuthnContext>
        </saml2:AuthnStatement>
        <saml2:AttributeStatement>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">Administrator</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">Metriport</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">urn:oid:2.16.840.1.113883.3.9621</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:nhin:names:saml:homeCommunityId" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">urn:oid:2.16.840.1.113883.3.9621</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue>
              <hl7:Role xmlns:hl7="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" code="224608005" codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED_CT" displayName="Administrator" xsi:type="hl7:CE"/>
            </saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue>
              <hl7:PurposeOfUse xmlns:hl7="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" code="TREATMENT" codeSystem="2.16.840.1.113883.3.18.7.1" codeSystemName="nhin-purpose" displayName="Treatment" xsi:type="hl7:CE"/>
            </saml2:AttributeValue>
          </saml2:Attribute>
        </saml2:AttributeStatement>
      </saml2:Assertion>
      <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
        <ds:SignedInfo>
          <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
          <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
          <ds:Reference URI="#TS-64151db7-c980-49ee-a20e-481d0b03c320">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
            <ds:DigestValue>l/eQCfhpf0/KZShdYsqxPqQRJVM=</ds:DigestValue>
          </ds:Reference>
        </ds:SignedInfo>
        <ds:SignatureValue>ztL0kvMcR0DbbZDv7mZoLLysUbcVYbXwaop6y0U/8k+PYpde+IMCXryhrZACgUjjG1LR5aWMLBMTuI3xy5M6mFRlNwSNwMEv02V9KOVPMcdrPpnqUnfqbsMI7pvEOwgIEgAtgoP06Nx+gkQ41Rke/BvnnTUM7g3r79MZZry6yl84s+j61vkFBtfUwZ/GxDK49wBXFueI1ajRdnCc6y6u8t6QePLROn8YxiMgnKAngZFJrAFlRYxfs24BnhriiZ83DDSc5A6eB/mwL2SRRkfFfKnjBVQv66H608XzBzpbVrUzilx4jG1Q4rg5W88jbHpGpAYqbArhIwlgSuFONysNDw==</ds:SignatureValue>
        <ds:KeyInfo>
          <wsse:SecurityTokenReference xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0" wsu:Id="46069586-6820-444a-97bf-5acc42be70b6">
            <wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">_6ca1b876-79aa-4e94-b51e-e7b1bdb3bfc9</wsse:KeyIdentifier>
          </wsse:SecurityTokenReference>
        </ds:KeyInfo>
      </ds:Signature>
      <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="TS-64151db7-c980-49ee-a20e-481d0b03c320">
        <wsu:Created>2023-12-06T22:51:28.380Z</wsu:Created>
        <wsu:Expires>2023-12-06T22:54:48.380Z</wsu:Expires>
      </wsu:Timestamp>
    </wsse:Security>
  </soap:Header>
  <soap:Body>
    <urn:RetrieveDocumentSetRequest>
      <urn:DocumentRequest>
        <urn:HomeCommunityId>urn:oid:1.2.840.114350.1.13.11511.3.7.3.688884.100.1000</urn:HomeCommunityId>
        <urn:RepositoryUniqueId>1.2.840.114350.1.13.11511.3.7.3.688884.100.1000</urn:RepositoryUniqueId>
        <urn:DocumentUniqueId>1.2.840.114350.1.13.11511.3.7.8.688883.110924</urn:DocumentUniqueId>
      </urn:DocumentRequest>
      <urn:DocumentRequest>
        <urn:HomeCommunityId>urn:oid:1.2.840.114350.1.13.11511.3.7.3.688884.100.1000</urn:HomeCommunityId>
        <urn:RepositoryUniqueId>1.2.840.114350.1.13.11511.3.7.3.688884.100.1000</urn:RepositoryUniqueId>
        <urn:DocumentUniqueId>1.2.840.114350.1.13.11511.3.7.8.688883.110925</urn:DocumentUniqueId>
      </urn:DocumentRequest>
      <urn:DocumentRequest>
        <urn:HomeCommunityId>urn:oid:1.2.840.114350.1.13.11511.3.7.3.688884.100.1000</urn:HomeCommunityId>
        <urn:RepositoryUniqueId>1.2.840.114350.1.13.11511.3.7.3.688884.100.1000</urn:RepositoryUniqueId>
        <urn:DocumentUniqueId>1.2.840.114350.1.13.11511.3.7.8.688883.110926</urn:DocumentUniqueId>
      </urn:DocumentRequest>
    </urn:RetrieveDocumentSetRequest>
  </soap:Body>
</soap:Envelope>
