.svn/pristine/c9/c9ed5014d7ec95079201fb79383826285fd3fbfd.svn-base


<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
    xmlns:a="http://www.w3.org/2005/08/addressing">
    <s:Header>
        <a:Action a:mustUnderstand="1">urn:ihe:iti:2007:CrossGatewayRetrieve</a:Action>
        <a:MessageID>urn:uuid:0fbfdced-6c01-4d09-a110-2201afedaa02</a:MessageID>
        <a:ReplyTo>
            <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
        </a:ReplyTo>
        <a:To>http://localhost:2647/XcaService/IHEXCAGateway.svc</a:To>
    </s:Header>
    <s:Body>
        <RetrieveDocumentSetRequest xmlns="urn:ihe:iti:xds-b:2007">
            <DocumentRequest>
                <HomeCommunityId>urn:oid:1.2.3.5</HomeCommunityId>
                <RepositoryUniqueId>1.3.6.1.4.1000</RepositoryUniqueId>
                <DocumentUniqueId>1.3.6.1.4.2300</DocumentUniqueId>
            </DocumentRequest>
            <DocumentRequest>
                <HomeCommunityId>urn:oid:1.2.3.5</HomeCommunityId>
                <RepositoryUniqueId>1.3.6.1.4.2000</RepositoryUniqueId>
                <DocumentUniqueId>1.3.6.1.4.2301</DocumentUniqueId>
            </DocumentRequest>
        </RetrieveDocumentSetRequest>
    </s:Body>
</s:Envelope>
